tap "charmbracelet/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "ngrok/ngrok"
brew "xz"
brew "openssl@3"
brew "autoconf"
brew "readline"
brew "sqlite"
brew "autojump"
brew "automake"
brew "awscli"
brew "bat"
brew "bison"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "dfu-util"
brew "dict"
brew "direnv"
brew "doctl"
brew "efm-langserver"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fpp"
brew "libtool"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gh"
brew "git"
brew "git-lfs"
brew "glab"
brew "gnu-typist"
brew "gnupg"
brew "gnuplot"
brew "goaccess"
brew "hugo"
brew "hyperfine"
brew "ios-deploy"
brew "jq"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "mongosh"
brew "multimarkdown"
brew "zlib"
brew "mysql"
brew "ncurses"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nginx"
brew "ninja"
brew "nmap"
brew "node"
brew "open-ocd"
brew "pandoc"
brew "poppler"
brew "pdfgrep"
brew "php"
brew "protobuf"
brew "protobuf-c"
brew "pure"
brew "pv"
brew "tcl-tk"
brew "pypy3.10"
brew "python@3.10"
brew "redis"
brew "ripgrep"
brew "rtx"
brew "sapling"
brew "shellcheck"
brew "sphinx-doc"
brew "stow"
brew "swig"
brew "tldr"
brew "tmux"
brew "tree"
brew "ttyd", args: ["HEAD"]
brew "universal-ctags"
brew "vivid"
brew "wget"
brew "wxwidgets"
brew "yasm"
brew "charmbracelet/tap/vhs"
brew "jesseduffield/lazygit/lazygit"
brew "mongodb/brew/mongodb-community"
cask "anki"
cask "audacity"
cask "brave-browser"
cask "chromedriver"
cask "chromium"
cask "discord"
cask "docker"
cask "emacs"
cask "figma"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-meslo-lg-nerd-font"
cask "gcc-arm-embedded"
cask "google-chrome"
cask "hammerspoon"
cask "inkscape"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "macdown"
cask "mediahuman-audio-converter"
cask "ngrok"
cask "pgadmin4"
cask "postgres-unofficial"
cask "raspberry-pi-imager"
cask "skim"
cask "steam"
cask "timemachineeditor"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "visual-studio-code"
cask "vnc-viewer"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.Bookmarks"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "amiralizadeh9480.cpp-helper"
vscode "astro-build.astro-vscode"
vscode "augustocdias.tasks-shell-input"
vscode "bencoleman.armview"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dtsvet.vscode-wasm"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "hedinne.popping-and-locking-vscode"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mechatroner.rainbow-csv"
vscode "meta.sapling-scm"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "Nixon.env-cmd-file-syntax"
vscode "Orta.vscode-jest"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.LiveServer"
vscode "ryanolsonx.solarized"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SumitSaha.learn-with-sumit-theme"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
