tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
brew "xz"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "readline"
brew "asdf"
brew "bison"
brew "cmake"
brew "efm-langserver"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "glab"
brew "gnupg"
brew "hugo"
brew "lazygit"
brew "libxml2"
brew "libxslt"
brew "multimarkdown"
brew "neofetch"
brew "neovim"
brew "nginx"
brew "nmap"
brew "poppler"
brew "pdfgrep"
brew "pure"
brew "pv"
brew "sqlite"
brew "python@3.10"
brew "redis"
brew "ripgrep"
brew "rtx"
brew "sapling"
brew "shellcheck"
brew "sphinx-doc"
brew "stow"
brew "swig"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "ttyd", args: ["HEAD"]
brew "universal-ctags"
brew "wget"
brew "wxwidgets"
brew "yasm"
brew "zlib"
cask "anki"
cask "brave-browser"
cask "chromedriver"
cask "chromium"
cask "discord"
cask "figma"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-meslo-lg-nerd-font"
cask "iterm2"
cask "karabiner-elements"
cask "notion"
cask "rectangle"
cask "visual-studio-code"