tap "charmbracelet/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "supabase/tap"
tap "tinygo-org/tools"
brew "xz"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "openssl@3"
brew "readline"
brew "asdf"
brew "bison"
brew "cmake"
brew "sqlite"
brew "python@3.10"
brew "efm-langserver"
brew "emscripten"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "glab"
brew "gnu-typist"
brew "gnupg"
brew "go"
brew "hugo"
brew "libxml2"
brew "libxslt"
brew "multimarkdown"
brew "ncurses"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nginx"
brew "nmap"
brew "poppler"
brew "pdfgrep"
brew "pure"
brew "pv"
brew "tcl-tk"
brew "redis"
brew "ripgrep"
brew "sapling"
brew "shellcheck"
brew "sphinx-doc"
brew "stow"
brew "swig"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "ttyd", args: ["HEAD"]
brew "universal-ctags"
brew "wget"
brew "wxwidgets"
brew "yasm"
brew "zlib"
brew "charmbracelet/tap/vhs"
brew "heroku/brew/heroku"
brew "jesseduffield/lazygit/lazygit"
brew "supabase/tap/supabase"
brew "tinygo-org/tools/tinygo"
cask "anki"
cask "brave-browser"
cask "chromedriver"
cask "chromium"
cask "discord"
cask "docker"
cask "emacs"
cask "figma"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-meslo-lg-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "lapce"
cask "macdown"
cask "mactex"
cask "pgadmin4"
cask "postgres-unofficial"
cask "raspberry-pi-imager"
cask "steam"
cask "timemachineeditor"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "visual-studio-code"
cask "vnc-viewer"
