tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "tinygo-org/tools"
brew "readline"
brew "sqlite"
brew "xz"
brew "llvm"
brew "ccls"
brew "cmake"
brew "coreutils"
brew "deno"
brew "efm-langserver"
brew "fd"
brew "findutils"
brew "gh"
brew "git"
brew "gnu-typist"
brew "go"
brew "hugo"
brew "libtool"
brew "multimarkdown"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "openjdk"
brew "openssl@3"
brew "poppler"
brew "pdfgrep"
brew "pure"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "sphinx-doc"
brew "stow"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "universal-ctags"
brew "wget"
brew "zig"
brew "zlib"
brew "heroku/brew/heroku"
brew "jesseduffield/lazygit/lazygit"
brew "tinygo-org/tools/tinygo"
cask "anki"
cask "chromedriver"
cask "discord"
cask "docker"
cask "emacs"
cask "figma"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-meslo-lg-nerd-font"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "macdown"
cask "mactex"
cask "miniconda"
cask "pgadmin4"
cask "postgres-unofficial"
cask "raspberry-pi-imager"
cask "stats"
cask "steam"
cask "virtualbox"
cask "visual-studio-code"
