tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "xz"
brew "autoconf"
brew "automake"
brew "bat"
brew "cmake"
brew "coreutils"
brew "doxygen"
brew "libtool"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "readline"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "hugo"
brew "jq"
brew "lazygit"
brew "libelf"
brew "libyaml"
brew "llvm@14"
brew "mise"
brew "neovim"
brew "nmap"
brew "pure"
brew "pv"
brew "rabbitmq"
brew "redis"
brew "ripgrep"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "vivid"
brew "wget"
brew "zoxide"
cask "anki"
cask "arc"
cask "brave-browser"
cask "discord"
cask "figma"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-meslo-lg-nerd-font"
cask "gimp"
cask "iterm2"
cask "karabiner-elements"
cask "notion"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "amiralizadeh9480.cpp-helper"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "augustocdias.tasks-shell-input"
vscode "bencoleman.armview"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dtsvet.vscode-wasm"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hedinne.popping-and-locking-vscode"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mechatroner.rainbow-csv"
vscode "meta.sapling-scm"
vscode "mhutchie.git-graph"
vscode "modular-mojotools.vscode-mojo"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "nixon.env-cmd-file-syntax"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "ryanolsonx.solarized"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sumitsaha.learn-with-sumit-theme"
vscode "svelte.svelte-vscode"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
