tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "lazygit"
brew "libtool"
brew "libyaml"
brew "neovim"
brew "nmap"
brew "pure"
brew "pv"
brew "readline"
brew "redis"
brew "ripgrep"
brew "rtx"
brew "tmux"
brew "tree"
brew "vivid"
brew "wget"
cask "anki"
cask "brave-browser"
cask "discord"
cask "figma"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-meslo-lg-nerd-font"
cask "iterm2"
cask "karabiner-elements"
cask "rectangle"
cask "notion"
cask "rectangle"
cask "visual-studio-code"
